#Область ПрограммныйИнтерфейс

// 10.03.24 Добавляем поля на форму документа
// Неправильно
//
//  Параметры:
//	Форма - Строка -  форма на которой создаются объекты
Процедура ДобавитьНаФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ПолеВГруппу(Форма);  
		ПолеВвода = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);	
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.МУ_СогласованнаяСкидка";
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда	
		ПолеВГруппу(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ПолеВГруппу(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда		
		ПолеНеВГруппу(Форма, Форма.Элементы.Основание);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ПолеНеВГруппу(Форма,Форма.Элементы.СуммаДокумента); 
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПолеВГруппу(Форма) 
    ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.МУ_КонтактноеЛицо";
КонецПроцедуры	

Процедура ПолеНеВГруппу(Форма, Поле) 
    ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"));	
	Форма.Элементы.Переместить(ПолеВвода,Форма,Поле);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.МУ_КонтактноеЛицо";
КонецПроцедуры
#КонецОбласти
