
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   

	//Начало. Доработка по задаче 2 модуль 11 
	Команда = Команды.Добавить("ПересчитатьСуммуПоСкидке");
	Команда.Заголовок = "Пересчитать сумму по скидке";
	Команда.Действие = "МУ_ПересчитатьСкидкуПосле"; 
	
	КнопкаФормы = ЭтотОбъект.Элементы.Добавить("ФормаПересчитатьСкидку", Тип("КнопкаФормы"), ЭтотОбъект.ЭтаФорма.КоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "ПересчитатьСуммуПоСкидке";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	
	ЭлементСогласованнаяСкидка = ЭтотОбъект.Элементы.МУ_СогласованнаяСкидка;
	ЭлементСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "МУ_СогласованнаяСкидкаПриИзмененииПосле");
	//Конец доработки

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
//Начало. Доработка по задаче 2 модуль 11	
//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;  
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	Если ЗначениеЗаполнено(Объект.МУ_СогласованнаяСкидка) Тогда   
		ПроцентСкидки = Объект.МУ_СогласованнаяСкидка + ТекущиеДанные.Скидка;
		Если ПроцентСкидки > 100 Тогда
			ПроцентСкидки = 100;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Скидка не может быть более 100%.";
			Сообщение.Сообщить();
		КонецЕсли;	
		Скидка = ТекущиеДанные.Сумма * ПроцентСкидки / 100;
		ТекущиеДанные.Сумма = ТекущиеДанные.Сумма - Скидка;  
	КонецЕсли;	
	РассчитатьСуммуДокумента();
//Конец
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти     



#Область ДоработкаПоЗаданиюМодуля11 
//Начало. Доработка по задаче 2 модуль 11 

&НаКлиенте
Процедура МУ_СогласованнаяСкидкаПриИзмененииПосле(Элемент)
//Начало. Модуль является доработкой по задаче 2 модуль 11 	
	ПересчетСуммТЧ();
//Конец
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПересчетСуммТЧ() 
//Начало. Модуль является доработкой по задаче 2 модуль 11 	
	
	Режим = РежимДиалогаВопрос.ДаНет;
	
	Если Объект.Товары.Количество() > 0 Тогда   
		Текст = "ru = 'Изменилась скидка. Пересчитать сумму по товарам?' ";
		Ответ = Ждать ВопросАсинх(НСтр(Текст), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Для Каждого СтрокаТЧ Из Объект.Товары Цикл
				
				РассчитатьСуммуСтроки(СтрокаТЧ);
				
			КонецЦикла;	 
		КонецЕсли;		
		
	КонецЕсли;	
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		Текст = "ru = 'Изменилась скидка. Пересчитать сумму по услугам?' ";
		Ответ = Ждать ВопросАсинх(НСтр(Текст), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
				
				РассчитатьСуммуСтроки(СтрокаТЧ);
				
			КонецЦикла;	
		КонецЕсли;	
		
	КонецЕсли;		
//Конец
КонецПроцедуры

//&НаКлиенте
//Процедура МУ_ПересчитатьСкидкуПосле(Команда)  
//Начало. Модуль является доработкой по задаче 2 модуль 11 	
//	ПересчетСуммТЧ(); 
//Конец
//КонецПроцедуры

//Конец
#КонецОбласти
